#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./modules/test`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.ai_studio_project.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.ai_studio_hub.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.container_registry.azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprjintacr001][0m
[0m[1mmodule.setup.module.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Insights/components/mbprj-int-ai001][0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.ai_studio_hub.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.ai_studio_project.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj-int-kv001][0m
[0m[1mmodule.setup.module.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001][0m
[0m[1mmodule.setup.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintacr001-registry-pe][0m
[0m[1mmodule.setup.module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj-int-kv001/providers/Microsoft.Authorization/roleAssignments/a71f68f1-52bb-574f-95b6-48a782c0fe81][0m
[0m[1mmodule.setup.module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj-int-kv001-vault-pe][0m
[0m[1mmodule.setup.module.container_registry.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T12:13:53Z][0m
[0m[1mmodule.setup.module.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001/providers/Microsoft.Authorization/roleAssignments/13155a70-de67-5f16-4a47-3eef84159ff4][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-table-pe][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-queue-pe][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-blob-pe][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-file-pe][0m
[0m[1mmodule.setup.module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T12:13:47Z][0m
[0m[1mmodule.setup.module.storage_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T12:14:18Z][0m
[0m[1mmodule.setup.module.ai_studio_hub.azapi_resource.ai_studio_hub: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010][0m
[0m[1mmodule.setup.module.ai_studio_hub.azurerm_private_endpoint.private_endpoint_ai_studio_hub: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj-int-aih010-amlworkspace-pe][0m
[0m[1mmodule.ai_studio_project.azapi_resource.ai_studio_project: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj001][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_outbound_rules: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_provision_managed_network[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010/provisionManagedNetwork][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["default-storage-table"]: Refreshing state... [id=3462423531738836556][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["default-storage-queue"]: Refreshing state... [id=3168487175720792952][0m
[0m[1mmodule.setup.module.ai_studio_hub.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T17:04:28Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_cognitive_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.ai_service.azapi_update_resource.cognitive_account_bypass_azureservices[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_update_resource" "cognitive_account_bypass_azureservices" {
      [32m+[0m[0m body                    = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m networkAcls         = {
                      [32m+[0m[0m bypass              = "AzureServices"
                      [32m+[0m[0m defaultAction       = "Deny"
                      [32m+[0m[0m ipRules             = []
                      [32m+[0m[0m virtualNetworkRules = []
                    }
                  [32m+[0m[0m publicNetworkAccess = "Disabled"
                }
            }
        )
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_casing           = false
      [32m+[0m[0m ignore_missing_property = false
      [32m+[0m[0m locks                   = []
      [32m+[0m[0m name                    = (known after apply)
      [32m+[0m[0m output                  = (known after apply)
      [32m+[0m[0m parent_id               = (known after apply)
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m response_export_values  = []
      [32m+[0m[0m type                    = "Microsoft.CognitiveServices/accounts@2023-05-01"
    }

[1m  # module.ai_service.azurerm_cognitive_account.cognitive_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_cognitive_account" "cognitive_account" {
      [32m+[0m[0m custom_subdomain_name              = "mbprj002-aoai001"
      [32m+[0m[0m dynamic_throttling_enabled         = false
      [32m+[0m[0m endpoint                           = (known after apply)
      [32m+[0m[0m fqdns                              = [
          [32m+[0m[0m "microsoft.com",
        ]
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m kind                               = "OpenAI"
      [32m+[0m[0m local_auth_enabled                 = false
      [32m+[0m[0m location                           = "swedencentral"
      [32m+[0m[0m name                               = "mbprj002-aoai001"
      [32m+[0m[0m outbound_network_access_restricted = true
      [32m+[0m[0m primary_access_key                 = (sensitive value)
      [32m+[0m[0m public_network_access_enabled      = false
      [32m+[0m[0m resource_group_name                = "tfmodule-test-rg"
      [32m+[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m sku_name                           = "S0"
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "test" = "aiservice"
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m network_acls {
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.ai_service.azurerm_private_endpoint.private_endpoint_cognitive_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mbprj002-aoai001-account-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mbprj002-aoai001-account-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "tfmodule-test-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/TerraformTestSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aiservice"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mbprj002-aoai001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mbprj002-aoai001-account-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "account",
            ]
        }
    }

[1m  # module.ai_service.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "0s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_outbound_rules[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource_action" "ai_studio_hub_outbound_rules" {
      [33m~[0m[0m body                   = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m managedNetwork = {
                  [33m~[0m[0m outboundRules = {
                      [32m+[0m[0m aoai                                         = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = {
                              [32m+[0m[0m serviceResourceId = (known after apply)
                              [32m+[0m[0m sparkEnabled      = true
                              [32m+[0m[0m sparkStatus       = "Active"
                              [32m+[0m[0m subresourceTarget = "account"
                            }
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "PrivateEndpoint"
                        }
                      [33m~[0m[0m default-storage-queue                        = {
                          [33m~[0m[0m destination = {
                              [33m~[0m[0m serviceResourceId = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001" -> (known after apply)
                                [90m# (3 unchanged attributes hidden)[0m[0m
                            }
                            [90m# (3 unchanged attributes hidden)[0m[0m
                        }
                      [33m~[0m[0m default-storage-table                        = {
                          [33m~[0m[0m destination = {
                              [33m~[0m[0m serviceResourceId = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001" -> (known after apply)
                                [90m# (3 unchanged attributes hidden)[0m[0m
                            }
                            [90m# (3 unchanged attributes hidden)[0m[0m
                        }
                        [90m# (47 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (2 unchanged attributes hidden)[0m[0m
                }
            }
        }
      [33m~[0m[0m id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010" -> (known after apply)
      [33m~[0m[0m output                 = {} -> (known after apply)
      [33m~[0m[0m resource_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_provision_managed_network[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource_action" "ai_studio_hub_provision_managed_network" {
      [33m~[0m[0m id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010/provisionManagedNetwork" -> (known after apply)
      [33m~[0m[0m output                 = {} -> (known after apply)
      [33m~[0m[0m resource_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["aoai"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "ai_studio_hub_private_endpoints_approval" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "private_endpoint_name" = "aoai"
        }
    }

[1m  # module.ai_studio_project.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_ai_studio_project[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_ai_studio_project" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.ai_studio_project.azapi_resource.ai_studio_project[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "ai_studio_project" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m description   = "AI Studio Project - mbprj001" [33m->[0m[0m "AI Studio Project - mbprj002"
              [33m~[0m[0m friendlyName  = "Mbprj001" [33m->[0m[0m "Mbprj002"
              [33m~[0m[0m hubResourceId = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010" -> (known after apply)
            }
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [33m~[0m[0m id                        = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj001" -> (known after apply)
      [33m~[0m[0m name                      = "mbprj001" [33m->[0m[0m "mbprj002" [31m# forces replacement[0m[0m
      [33m~[0m[0m output                    = {} -> (known after apply)
        tags                      = {
            "test" = "aistudioproject"
        }
        [90m# (9 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [33m~[0m[0m principal_id = "6b8ce4a6-d594-4696-a464-bafd014fdd3d" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.ai_studio_hub.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_ai_studio_hub[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_ai_studio_hub" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.ai_studio_hub.azapi_resource.ai_studio_hub[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "ai_studio_hub" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m applicationInsights             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Insights/components/mbprj-int-ai001" -> (known after apply)
              [33m~[0m[0m containerRegistry               = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprjintacr001" -> (known after apply)
              [33m~[0m[0m friendlyName                    = "Mbprj Int Aih010" [33m->[0m[0m "Mbprj002 Int Aih010"
              [33m~[0m[0m keyVault                        = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj-int-kv001" -> (known after apply)
              [33m~[0m[0m storageAccount                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001" -> (known after apply)
                [90m# (13 unchanged attributes hidden)[0m[0m
            }
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [33m~[0m[0m id                        = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010" -> (known after apply)
      [33m~[0m[0m name                      = "mbprj-int-aih010" [33m->[0m[0m "mbprj002-int-aih010" [31m# forces replacement[0m[0m
      [33m~[0m[0m output                    = {} -> (known after apply)
      [33m~[0m[0m tags                      = {
          [31m-[0m[0m "__SYSTEM__AzureOpenAI_aoaimabusscs001" = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/aml-test-rg/providers/Microsoft.CognitiveServices/accounts/aoai-mabuss-cs001" [90m-> null[0m[0m
            "test"                                  = "aistudioproject"
        }
        [90m# (9 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [33m~[0m[0m principal_id = "e01ca126-382a-4d77-b0ef-7c09791e2ab2" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # module.setup.module.ai_studio_hub.azurerm_private_endpoint.private_endpoint_ai_studio_hub[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_ai_studio_hub" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprj-int-aih010-amlworkspace-nic" [33m->[0m[0m "mbprj002-int-aih010-amlworkspace-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj-int-aih010-amlworkspace-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj-int-aih010-amlworkspace-pe" [33m->[0m[0m "mbprj002-int-aih010-amlworkspace-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprj-int-aih010-amlworkspace-nic"
              [31m-[0m[0m name = "mbprj-int-aih010-amlworkspace-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj-int-aih010-amlworkspace-pe/privateDnsZoneGroups/mbprj-int-aih010-arecord/privateDnsZoneConfigs/privatelink.api.azureml.ms"
              [31m-[0m[0m name                = "privatelink.api.azureml.ms"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "a6a2816b-fbc0-4a7b-bd18-45bf28d30e7f.workspace.northeurope.privatelink.api.azureml.ms"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.7",
                        ]
                      [31m-[0m[0m name         = "a6a2816b-fbc0-4a7b-bd18-45bf28d30e7f.workspace.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "a6a2816b-fbc0-4a7b-bd18-45bf28d30e7f.workspace.northeurope.cert.privatelink.api.azureml.ms"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.7",
                        ]
                      [31m-[0m[0m name         = "a6a2816b-fbc0-4a7b-bd18-45bf28d30e7f.workspace.northeurope.cert"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "*.a6a2816b-fbc0-4a7b-bd18-45bf28d30e7f.inference.northeurope.privatelink.api.azureml.ms"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.9",
                        ]
                      [31m-[0m[0m name         = "*.a6a2816b-fbc0-4a7b-bd18-45bf28d30e7f.inference.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj-int-aih010-amlworkspace-pe/privateDnsZoneGroups/mbprj-int-aih010-arecord/privateDnsZoneConfigs/privatelink.notebooks.azure.net"
              [31m-[0m[0m name                = "privatelink.notebooks.azure.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "ml-mbprj-int-a-northeurope-a6a2816b-fbc0-4a7b-bd18-45bf28d30e7f.northeurope.privatelink.notebooks.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.8",
                        ]
                      [31m-[0m[0m name         = "ml-mbprj-int-a-northeurope-a6a2816b-fbc0-4a7b-bd18-45bf28d30e7f.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj-int-aih010-amlworkspace-pe/privateDnsZoneGroups/mbprj-int-aih010-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprj-int-aih010-arecord" [33m->[0m[0m "mbprj002-int-aih010-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprj-int-aih010-amlworkspace-pe" [33m->[0m[0m "mbprj002-int-aih010-amlworkspace-pe" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj-int-aih010" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.7" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_application_insights" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.application_insights.azurerm_application_insights.application_insights[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_application_insights" "application_insights" {
      [33m~[0m[0m app_id                                = "bf7d83f6-6b40-4ffa-a2b3-62c2d964c534" -> (known after apply)
      [33m~[0m[0m connection_string                     = (sensitive value)
      [33m~[0m[0m id                                    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Insights/components/mbprj-int-ai001" -> (known after apply)
      [33m~[0m[0m instrumentation_key                   = (sensitive value)
      [33m~[0m[0m name                                  = "mbprj-int-ai001" [33m->[0m[0m "mbprj002-int-ai001" [31m# forces replacement[0m[0m
        tags                                  = {
            "test" = "aistudioproject"
        }
        [90m# (13 unchanged attributes hidden)[0m[0m
    }

[1m  # module.setup.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_container_registry" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.container_registry.azurerm_container_registry.container_registry[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_container_registry" "container_registry" {
      [32m+[0m[0m admin_password                = (sensitive value)
      [32m+[0m[0m admin_username                = (known after apply)
      [33m~[0m[0m encryption                    = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprjintacr001" -> (known after apply)
      [33m~[0m[0m login_server                  = "mbprjintacr001.azurecr.io" -> (known after apply)
      [33m~[0m[0m name                          = "mbprjintacr001" [33m->[0m[0m "mbprj002intacr001" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_rule_set              = [
          [33m~[0m[0m {
              [31m-[0m[0m ip_rule        = []
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (13 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [31m-[0m[0m identity_ids = [] [90m-> null[0m[0m
          [33m~[0m[0m principal_id = "9a9163bb-ef3f-40ba-a5d1-5cbbc96685c7" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # module.setup.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "container_registry_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprjintacr001-nic" [33m->[0m[0m "mbprj002intacr001-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintacr001-registry-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprjintacr001-registry-pe" [33m->[0m[0m "mbprj002intacr001-registry-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprjintacr001-nic"
              [31m-[0m[0m name = "mbprjintacr001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintacr001-registry-pe/privateDnsZoneGroups/mbprjintacr001-arecord/privateDnsZoneConfigs/privatelink.azurecr.io"
              [31m-[0m[0m name                = "privatelink.azurecr.io"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprjintacr001.northeurope.data.privatelink.azurecr.io"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.10",
                        ]
                      [31m-[0m[0m name         = "mbprjintacr001.northeurope.data"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprjintacr001.privatelink.azurecr.io"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.11",
                        ]
                      [31m-[0m[0m name         = "mbprjintacr001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintacr001-registry-pe/privateDnsZoneGroups/mbprjintacr001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprjintacr001-arecord" [33m->[0m[0m "mbprj002intacr001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprjintacr001-svc" [33m->[0m[0m "mbprj002intacr001-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprjintacr001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.10" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.key_vault.azurerm_key_vault.key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m access_policy                   = [
          [31m-[0m[0m {
              [31m-[0m[0m certificate_permissions = [
                  [31m-[0m[0m "all",
                ]
              [31m-[0m[0m key_permissions         = [
                  [31m-[0m[0m "all",
                ]
              [31m-[0m[0m object_id               = "e01ca126-382a-4d77-b0ef-7c09791e2ab2"
              [31m-[0m[0m secret_permissions      = [
                  [31m-[0m[0m "all",
                ]
              [31m-[0m[0m storage_permissions     = []
              [31m-[0m[0m tenant_id               = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
      [33m~[0m[0m id                              = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj-int-kv001" -> (known after apply)
      [33m~[0m[0m name                            = "mbprj-int-kv001" [33m->[0m[0m "mbprj002-int-kv001" [31m# forces replacement[0m[0m
        tags                            = {
            "test" = "aistudioproject"
        }
      [33m~[0m[0m vault_uri                       = "https://mbprj-int-kv001.vault.azure.net/" -> (known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m contact (known after apply)

      [33m~[0m[0m network_acls {
          [31m-[0m[0m ip_rules                   = [] [90m-> null[0m[0m
          [31m-[0m[0m virtual_network_subnet_ids = [] [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprj-int-kv001-vault-nic" [33m->[0m[0m "mbprj002-int-kv001-vault-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj-int-kv001-vault-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj-int-kv001-vault-pe" [33m->[0m[0m "mbprj002-int-kv001-vault-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprj-int-kv001-vault-nic"
              [31m-[0m[0m name = "mbprj-int-kv001-vault-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj-int-kv001-vault-pe/privateDnsZoneGroups/mbprj-int-kv001-arecord/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              [31m-[0m[0m name                = "privatelink.vaultcore.azure.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprj-int-kv001.privatelink.vaultcore.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.12",
                        ]
                      [31m-[0m[0m name         = "mbprj-int-kv001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj-int-kv001-vault-pe/privateDnsZoneGroups/mbprj-int-kv001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprj-int-kv001-arecord" [33m->[0m[0m "mbprj002-int-kv001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprj-int-kv001-vault-svc" [33m->[0m[0m "mbprj002-int-kv001-vault-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj-int-kv001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.12" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [33m~[0m[0m id                                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj-int-kv001/providers/Microsoft.Authorization/roleAssignments/a71f68f1-52bb-574f-95b6-48a782c0fe81" -> (known after apply)
      [33m~[0m[0m name                                   = "a71f68f1-52bb-574f-95b6-48a782c0fe81" -> (known after apply)
      [33m~[0m[0m principal_type                         = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      [33m~[0m[0m scope                                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj-int-kv001" -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check       = (known after apply)
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # module.setup.module.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprjintstg001-blob-nic" [33m->[0m[0m "mbprj002intstg001-blob-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-blob-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprjintstg001-blob-pe" [33m->[0m[0m "mbprj002intstg001-blob-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprjintstg001-blob-nic"
              [31m-[0m[0m name = "mbprjintstg001-blob-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-blob-pe/privateDnsZoneGroups/mbprjintstg001-arecord/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              [31m-[0m[0m name                = "privatelink.blob.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprjintstg001.privatelink.blob.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.4",
                        ]
                      [31m-[0m[0m name         = "mbprjintstg001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-blob-pe/privateDnsZoneGroups/mbprjintstg001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprjintstg001-arecord" [33m->[0m[0m "mbprj002intstg001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprjintstg001-blob-svc" [33m->[0m[0m "mbprj002intstg001-blob-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.4" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprjintstg001-file-nic" [33m->[0m[0m "mbprj002intstg001-file-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-file-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprjintstg001-file-pe" [33m->[0m[0m "mbprj002intstg001-file-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprjintstg001-file-nic"
              [31m-[0m[0m name = "mbprjintstg001-file-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-file-pe/privateDnsZoneGroups/mbprjintstg001-arecord/privateDnsZoneConfigs/privatelink.file.core.windows.net"
              [31m-[0m[0m name                = "privatelink.file.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprjintstg001.privatelink.file.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.5",
                        ]
                      [31m-[0m[0m name         = "mbprjintstg001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-file-pe/privateDnsZoneGroups/mbprjintstg001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprjintstg001-arecord" [33m->[0m[0m "mbprj002intstg001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprjintstg001-file-svc" [33m->[0m[0m "mbprj002intstg001-file-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.5" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprjintstg001-queue-nic" [33m->[0m[0m "mbprj002intstg001-queue-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-queue-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprjintstg001-queue-pe" [33m->[0m[0m "mbprj002intstg001-queue-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprjintstg001-queue-nic"
              [31m-[0m[0m name = "mbprjintstg001-queue-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-queue-pe/privateDnsZoneGroups/mbprjintstg001-arecord/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              [31m-[0m[0m name                = "privatelink.queue.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprjintstg001.privatelink.queue.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.6",
                        ]
                      [31m-[0m[0m name         = "mbprjintstg001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-queue-pe/privateDnsZoneGroups/mbprjintstg001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprjintstg001-arecord" [33m->[0m[0m "mbprj002intstg001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprjintstg001-queue-svc" [33m->[0m[0m "mbprj002intstg001-queue-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.6" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprjintstg001-table-nic" [33m->[0m[0m "mbprj002intstg001-table-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-table-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprjintstg001-table-pe" [33m->[0m[0m "mbprj002intstg001-table-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprjintstg001-table-nic"
              [31m-[0m[0m name = "mbprjintstg001-table-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-table-pe/privateDnsZoneGroups/mbprjintstg001-arecord/privateDnsZoneConfigs/privatelink.table.core.windows.net"
              [31m-[0m[0m name                = "privatelink.table.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprjintstg001.privatelink.table.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.13",
                        ]
                      [31m-[0m[0m name         = "mbprjintstg001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprjintstg001-table-pe/privateDnsZoneGroups/mbprjintstg001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprjintstg001-arecord" [33m->[0m[0m "mbprj002intstg001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprjintstg001-table-svc" [33m->[0m[0m "mbprj002intstg001-table-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.13" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_storage_blob_data_owner" {
      [33m~[0m[0m id                                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001/providers/Microsoft.Authorization/roleAssignments/13155a70-de67-5f16-4a47-3eef84159ff4" -> (known after apply)
      [33m~[0m[0m name                                   = "13155a70-de67-5f16-4a47-3eef84159ff4" -> (known after apply)
      [33m~[0m[0m role_definition_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      [33m~[0m[0m scope                                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001" -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check       = (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.setup.module.storage_account.azurerm_storage_account.storage_account[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_storage_account" "storage_account" {
      [33m~[0m[0m id                                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprjintstg001" -> (known after apply)
      [33m~[0m[0m local_user_enabled                 = false [33m->[0m[0m true
      [33m~[0m[0m name                               = "mbprjintstg001" [33m->[0m[0m "mbprj002intstg001" [31m# forces replacement[0m[0m
      [33m~[0m[0m primary_access_key                 = (sensitive value)
      [33m~[0m[0m primary_blob_connection_string     = (sensitive value)
      [33m~[0m[0m primary_blob_endpoint              = "https://mbprjintstg001.blob.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_blob_host                  = "mbprjintstg001.blob.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_blob_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_blob_internet_host         = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_host        = (known after apply)
      [33m~[0m[0m primary_connection_string          = (sensitive value)
      [33m~[0m[0m primary_dfs_endpoint               = "https://mbprjintstg001.dfs.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_dfs_host                   = "mbprjintstg001.dfs.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_dfs_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_dfs_internet_host          = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_host         = (known after apply)
      [33m~[0m[0m primary_file_endpoint              = "https://mbprjintstg001.file.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_file_host                  = "mbprjintstg001.file.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_file_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_file_internet_host         = (known after apply)
      [32m+[0m[0m primary_file_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_file_microsoft_host        = (known after apply)
      [33m~[0m[0m primary_location                   = "northeurope" -> (known after apply)
      [33m~[0m[0m primary_queue_endpoint             = "https://mbprjintstg001.queue.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_queue_host                 = "mbprjintstg001.queue.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_queue_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_host       = (known after apply)
      [33m~[0m[0m primary_table_endpoint             = "https://mbprjintstg001.table.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_table_host                 = "mbprjintstg001.table.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_table_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_table_microsoft_host       = (known after apply)
      [33m~[0m[0m primary_web_endpoint               = "https://mbprjintstg001.z16.web.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_web_host                   = "mbprjintstg001.z16.web.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_web_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_web_internet_host          = (known after apply)
      [32m+[0m[0m primary_web_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_web_microsoft_host         = (known after apply)
      [33m~[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string   = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint            = (known after apply)
      [32m+[0m[0m secondary_blob_host                = (known after apply)
      [32m+[0m[0m secondary_blob_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_blob_internet_host       = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_host      = (known after apply)
      [33m~[0m[0m secondary_connection_string        = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint             = (known after apply)
      [32m+[0m[0m secondary_dfs_host                 = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_host        = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_host       = (known after apply)
      [32m+[0m[0m secondary_file_endpoint            = (known after apply)
      [32m+[0m[0m secondary_file_host                = (known after apply)
      [32m+[0m[0m secondary_file_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_file_internet_host       = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_location                 = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint           = (known after apply)
      [32m+[0m[0m secondary_queue_host               = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_table_endpoint           = (known after apply)
      [32m+[0m[0m secondary_table_host               = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_web_endpoint             = (known after apply)
      [32m+[0m[0m secondary_web_host                 = (known after apply)
      [32m+[0m[0m secondary_web_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_web_internet_host        = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_host       = (known after apply)
      [33m~[0m[0m shared_access_key_enabled          = false [33m->[0m[0m true
        tags                               = {
            "test" = "aistudioproject"
        }
        [90m# (22 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m blob_properties {
          [31m-[0m[0m change_feed_retention_in_days = 0 [90m-> null[0m[0m
          [32m+[0m[0m default_service_version       = (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m

            [90m# (3 unchanged blocks hidden)[0m[0m
        }

      [33m~[0m[0m network_rules {
          [33m~[0m[0m ip_rules                   = [] -> (known after apply)
          [33m~[0m[0m virtual_network_subnet_ids = [] -> (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m

          [31m-[0m[0m private_link_access {
              [31m-[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/StorageDataScanner" [90m-> null[0m[0m
              [31m-[0m[0m endpoint_tenant_id   = "37963dd4-f4e6-40f8-a7d6-24b97919e452" [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m queue_properties (known after apply)
      [31m-[0m[0m queue_properties {
          [31m-[0m[0m hour_metrics {
              [31m-[0m[0m enabled               = true [90m-> null[0m[0m
              [31m-[0m[0m include_apis          = true [90m-> null[0m[0m
              [31m-[0m[0m retention_policy_days = 7 [90m-> null[0m[0m
              [31m-[0m[0m version               = "1.0" [90m-> null[0m[0m
            }
          [31m-[0m[0m logging {
              [31m-[0m[0m delete                = false [90m-> null[0m[0m
              [31m-[0m[0m read                  = false [90m-> null[0m[0m
              [31m-[0m[0m retention_policy_days = 0 [90m-> null[0m[0m
              [31m-[0m[0m version               = "1.0" [90m-> null[0m[0m
              [31m-[0m[0m write                 = false [90m-> null[0m[0m
            }
          [31m-[0m[0m minute_metrics {
              [31m-[0m[0m enabled               = false [90m-> null[0m[0m
              [31m-[0m[0m include_apis          = false [90m-> null[0m[0m
              [31m-[0m[0m retention_policy_days = 0 [90m-> null[0m[0m
              [31m-[0m[0m version               = "1.0" [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m share_properties (known after apply)
      [31m-[0m[0m share_properties {
          [31m-[0m[0m cors_rule {
              [31m-[0m[0m allowed_headers    = [
                  [31m-[0m[0m "*",
                ] [90m-> null[0m[0m
              [31m-[0m[0m allowed_methods    = [
                  [31m-[0m[0m "GET",
                  [31m-[0m[0m "HEAD",
                  [31m-[0m[0m "PUT",
                  [31m-[0m[0m "DELETE",
                  [31m-[0m[0m "OPTIONS",
                  [31m-[0m[0m "POST",
                ] [90m-> null[0m[0m
              [31m-[0m[0m allowed_origins    = [
                  [31m-[0m[0m "https://mlworkspace.azure.ai",
                  [31m-[0m[0m "https://ml.azure.com",
                  [31m-[0m[0m "https://*.ml.azure.com",
                  [31m-[0m[0m "https://ai.azure.com",
                  [31m-[0m[0m "https://*.ai.azure.com",
                ] [90m-> null[0m[0m
              [31m-[0m[0m exposed_headers    = [
                  [31m-[0m[0m "*",
                ] [90m-> null[0m[0m
              [31m-[0m[0m max_age_in_seconds = 1800 [90m-> null[0m[0m
            }
          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days = 7 [90m-> null[0m[0m
            }
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 22 to add, 0 to change, 17 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>